{"os":{"easy":[["1. What is an operating system?","a) collection of programs that manages hardware resources","b) system service provider to the application programs","c) interface between the hardware and application programs","d) all of the mentioned"," Answer: d\nExplanation: An Operating System acts as an intermediary between user/user applications/application programs and hardware. It is a program that manages hardware resources. It provides services to application programs.\n"],["2. To access the services of operating system, the interface is provided by the ___________","a) System calls","b) API","c) Library","d) Assembly instructions"," Answer: a\nExplanation: To access services of the Operating System an interface is provided by the System Calls. Generally, these are functions written in C and C++. Open, Close, Read, Write are some of most prominently used system calls.\n"],["3. Which one of the following is not true?","a) kernel is the program that constitutes the central core of the operating system","b) kernel is the first part of operating system to load into memory during booting","c) kernel is made of various modules which can not be loaded in running operating system","d) kernel remains in the memory during the entire computer session"," Answer: c\nExplanation: Kernel is the first program which is loaded in memory when OS is loading as well as it remains in memory till OS is running. Kernel is the core part of the OS which is responsible for managing resources, allowing multiple processes to use the resources and provide services to various processes. Kernel modules can be loaded and unloaded in run-time i.e. in running OS.\n"],["4. Which one of the following error will be handle by the operating system?","a) power failure","b) lack of paper in printer","c) connection failure in the network","d) all of the mentioned"," Answer: d\nExplanation: All the mentioned errors are handled by OS. The OS is continuously monitoring all of its resources. Also, the OS is constantly detecting and correcting errors.\n"],["5. What is the main function of the command interpreter?","a) to get and execute the next user-specified command","b) to provide the interface between the API and application program","c) to handle the files in operating system","d) none of the mentioned"," Answer: a\nExplanation: The main function of command interpreter is to get and execute the next user-specified command. Command Interpreter checks for valid command and then runs that command else it will throw an error.\n"],["1. The systems which allow only one process execution at a time, are called __________","a) uniprogramming systems","b) uniprocessing systems","c) unitasking systems","d) none of the mentioned"," Answer: b\nExplanation: Those systems which allows more than one process execution at a time, are called multiprogramming systems. Uniprocessing means only one processor.\n"],["2. In operating system, each process has its own __________","a) address space and global variables","b) open files","c) pending alarms, signals and signal handlers","d) all of the mentioned"," Answer: d\nExplanation: In Operating Systems, each process has its own address space which contains code, data, stack and heap segments or sections. Each process also has a list of files which is opened by the process as well as all pending alarms, signals and various signal handlers.\n"],["3. In Unix, Which system call creates the new process?","a) fork","b) create","c) new","d) none of the mentioned"," Answer: a\nExplanation: In UNIX, a new process is created by fork() system call. fork() system call returns a process ID which is generally the process id of the child process created.\n"],["4. A process can be terminated due to __________","a) normal exit","b) fatal error","c) killed by another process","d) all of the mentioned"," Answer: d\nExplanation: A process can be terminated normally by completing its task or because of fatal error or killed by another process or forcefully killed by a user. When the process completes its task without any error then it exits normally. The process may exit abnormally because of the occurrence of fatal error while it is running. The process can be killed or terminated forcefully by another process.\n"],["5. What is the ready state of a process?","a) when process is scheduled to run after some execution","b) when process is unable to run until some task has been completed","c) when process is using the CPU","d) none of the mentioned"," Answer: a\nExplanation: Ready state of the process means process has all necessary resources which are required for execution of that process when CPU is allocated. Process is ready for execution but waiting for the CPU to be allocated.\n"],["1. A Process Control Block(PCB) does not contain which of the following?","a) Code","b) Stack","c) Bootstrap program","d) Data"," Answer: c\nExplanation: Process Control Block (PCB) contains information related to a process such as Process State, Program Counter, CPU Register, etc. Process Control Block is also known as Task Control Block. Bootstrap program is a program which runs initially when the system or computer is booted or rebooted."],["2. The number of processes completed per unit time is known as __________","a) Output","b) Throughput","c) Efficiency","d) Capacity"," Answer: b\nExplanation: The number of processes completed per unit time is known as Throughput. Suppose there are 4 processes A, B, C & D they are taking 1, 3, 4 & 7 units of time respectively for their executions. For 10 units of time, throughput is high if process A, B & C are running first as 3 processes can execute. If process C runs first then throughput is low as maximum only 2 processes can execute. Throughput is low for processes which take a long time for execution. Throughput is high for processes which take a short time for execution."],["3. The state of a process is defined by __________","a) the final activity of the process","b) the activity just executed by the process","c) the activity to next be executed by the process","d) the current activity of the process"," Answer: d\nExplanation: The state of a process is defined by the current activity of the process. A process state changes when the process executes. The process states are as New, Ready, Running, Wait, Terminated."],["4. Which of the following is not the state of a process?","a) New","b) Old","c) Waiting","d) Running"," Answer: b\nExplanation: There is no process state such as old. When a process is created then the process is in New state. When the process gets the CPU for its execution then the process is in Running state. When the process is waiting for an external event then the process is in a Waiting state.\n"],["5. What is a Process Control Block?","a) Process type variable","b) Data Structure","c) A secondary storage section","d) A Block in memory"," Answer: b\nExplanation: A Process Control Block (PCB) is a data structure. It contains information related to a process such as Process State, Program Counter, CPU Register, etc. Process Control Block is also known as Task Control Block."],["1. Which of the following do not belong to queues for processes?","a) Job Queue","b) PCB queue","c) Device Queue","d) Ready Queue"," Answer: b\nExplanation: PCB queue does not belong to queues for processes. PCB is a process control block which contains information related to process. Each process is represented by PCB."],["2. When the process issues an I/O request __________","a) It is placed in an I/O queue","b) It is placed in a waiting queue","c) It is placed in the ready queue","d) It is placed in the Job queue"," Answer: a\nExplanation: When the process issues an I/O request it is placed in an I/O queue. I/O is a resource and it should be used effectively and every process should get access to it. There might be multiple processes which requested for I/O. Depending on scheduling algorithm I/O is allocated to any particular process and after completing I/O operation, I/O access is returned to the OS."],["3. What will happen when a process terminates?","a) It is removed from all queues","b) It is removed from all, but the job queue","c) Its process control block is de-allocated","d) Its process control block is never de-allocated"," Answer: a\nExplanation: When a process terminates, it removes from all queues. All allocated resources to that particular process are deallocated and all those resources are returned back to OS."],["4. What is a long-term scheduler?","a) It selects processes which have to be brought into the ready queue","b) It selects processes which have to be executed next and allocates CPU","c) It selects processes which heave to remove from memory by swapping","d) None of the mentioned"," Answer: a\nExplanation: A long-term scheduler selects processes which have to be brought into the ready queue. When processes enter the system, they are put in the job queue. Long-term scheduler selects processes from the job queue and puts them in the ready queue. It is also known as Job Scheduler. "],["5. If all processes I/O bound, the ready queue will almost always be ______ and the Short term Scheduler will have a ______ to do.","a) full, little","b) full, lot","c) empty, little","d) empty, lot","Answer: c\nExplanation: If all processes are I/O bound, the ready queue will almost empty and the short-term scheduler will have a little to do. I/O bound processes spend more time doing I/O than computation."],["1. Which process can be affected by other processes executing in the system?","a) cooperating process","b) child process","c) parent process","d) init process"," Answer: a\nExplanation: None.\n"],["2. When several processes access the same data concurrently and the outcome of the execution depends on the particular order in which the access takes place, is called?","a) dynamic condition","b) race condition","c) essential condition","d) critical condition"," Answer: b\nExplanation: None.\n"],["3. If a process is executing in its critical section, then no other processes can be executing in their critical section. This condition is called?","a) mutual exclusion","b) critical exclusion","c) synchronous exclusion","d) asynchronous exclusion"," Answer: a\nExplanation: None.\n"],["4. Which one of the following is a synchronization tool?","a) thread","b) pipe","c) semaphore","d) socket"," Answer: c\nExplanation: None.\n"],["5. A semaphore is a shared integer variable __________","a) that can not drop below zero","b) that can not be more than zero","c) that can not drop below one","d) that can not be more than one"," Answer: a\nExplanation: None.\n"]],"medium":[["6. In Operating Systems, which of the following is/are CPU scheduling algorithms?","a) Round Robin","b) Shortest Job First","c) Priority","d) All of the mentioned"," Answer: d\nExplanation: In Operating Systems, CPU scheduling algorithms are:\ni) First Come First Served scheduling\nii) Shortest Job First scheduling\niii) Priority scheduling\niv) Round Robin scheduling\nv) Multilevel Queue scheduling\nvi) Multilevel Feedback Queue scheduling\nAll of these scheduling algorithms have their own advantages and disadvantages.\n"],["7. If a process fails, most operating system write the error information to a ______","a) log file","b) another running process","c) new file","d) none of the mentioned"," Answer: a\nExplanation: If a process fails, most operating systems write the error information to a log file. Log file is examined by the debugger, to find out what is the actual cause of that particular problem. Log file is useful for system programmers for correcting errors.\n"],["8. Which facility dynamically adds probes to a running system, both in user processes and in the kernel?","a) DTrace","b) DLocate","c) DMap","d) DAdd"," Answer: a\nExplanation: A facility that dynamically adds probes to a running system, both in user process and in the kernel is called DTrace. This is very much useful in troubleshooting kernels in real-time.\n"],["6. What is interprocess communication?","a) communication within the process","b) communication between two process","c) communication between two threads of same process","d) none of the mentioned"," Answer: b\nExplanation: Interprocess Communication (IPC) is a communication mechanism that allows processes to communicate with each other and synchronise their actions without using the same address space. IPC can be achieved using shared memory and message passing.\n"],["7. A set of processes is deadlock if __________","a) each process is blocked and will remain so forever","b) each process is terminated","c) all processes are trying to kill each other","d) none of the mentioned"," Answer: a\nExplanation: Deadlock is a situation which occurs because process A is waiting for one resource and holds another resource (blocking resource). At the same time another process B demands blocking a resource as it is already held by a process A, process B is waiting state unless and until process A releases occupied resource.\n"],["8. A process stack does not contain __________","a) Function parameters","b) Local variables","c) Return addresses","d) PID of child process"," Answer: d\nExplanation: Process stack contains Function parameters, Local variables and Return address. It does not contain the PID of child process.\n"],["6. The entry of all the PCBs of the current processes is in __________","a) Process Register","b) Program Counter","c) Process Table","d) Process Unit"," Answer: c\nExplanation: The entry of all the PCBs of the current processes is in Process Table. The Process Table has the status of each and every process that is created in OS along with their PIDs.\n"],["7. What is the degree of multiprogramming?","a) the number of processes executed per unit time","b) the number of processes in the ready queue","c) the number of processes in the I/O queue","d) the number of processes in memory","Answer: d\nExplanation: Multiprogramming means the number of processes are in the ready states. To increase utilization of CPU, Multiprogramming is one of the most important abilities of OS. Generally, a single process cannot use CPU or I/O at all time, whenever CPU or I/O is available another process can use it. By doing this CPU utilization is increased."],["8. A single thread of control allows the process to perform __________","a) only one task at a time","b) multiple tasks at a time","c) only two tasks at a time","d) all of the mentioned","Answer: a\nExplanation: A single thread of control allows the process to perform only one task at a time. In the case of multi-core, multiple threads can be run simultaneously and can perform multiple tasks at a time."],["6. What is a medium-term scheduler?","a) It selects which process has to be brought into the ready queue","b) It selects which process has to be executed next and allocates CPU","c) It selects which process to remove from memory by swapping","d) None of the mentioned"," Answer: c\nExplanation: A medium-term scheduler selects which process to remove from memory by swapping. The medium-term scheduler swapped out the process and later swapped in. Swapping helps to free up memory."],["7. What is a short-term scheduler?","a) It selects which process has to be brought into the ready queue","b) It selects which process has to be executed next and allocates CPU","c) It selects which process to remove from memory by swapping","d) None of the mentioned"," Answer: b\nExplanation: A short-term scheduler selects a process which has to be executed next and allocates CPU. Short-term scheduler selects a process from the ready queue. It selects processes frequently.\n"],["8. The primary distinction between the short term scheduler and the long term scheduler is __________","a) The length of their queues","b) The type of processes they schedule","c) The frequency of their execution","d) None of the mentioned","Answer: c\nExplanation: The primary distinction between the short-term scheduler and long-term scheduler is the frequency of their execution. Short-term scheduler executes frequently while long-term scheduler executes much less frequently."],["6. Mutual exclusion can be provided by the __________","a) mutex locks","b) binary semaphores","c) both mutex locks and binary semaphores","d) none of the mentioned"," Answer: c\nExplanation: Binary Semaphores are known as mutex locks.\n"],["7. When high priority task is indirectly preempted by medium priority task effectively inverting the relative priority of the two tasks, the scenario is called __________","a) priority inversion","b) priority removal","c) priority exchange","d) priority modification"," Answer: a\nExplanation: None.\n"],["8. Process synchronization can be done on __________","a) hardware level","b) software level","c) both hardware and software level","d) none of the mentioned"," Answer: c\nExplanation: None.\n"]],"hard":[["9. Which one of the following is not a real time operating system?","a) VxWorks","b) QNX","c) RTLinux","d) Palm OS"," Answer: d","Explanation: VxWorks, QNX & RTLinux are real-time operating systems. Palm OS is a mobile operating system. Palm OS is developed for Personal Digital Assistants (PDAs).",""],["10. The OS X has ____________","a) monolithic kernel","b) hybrid kernel","c) microkernel","d) monolithic kernel with modules"," Answer: b","Explanation: OS X has a hybrid kernel. Hybrid kernel is a combination of two different kernels. OS X is developed by Apple and originally it is known as Mac OS X.",""],["9. Which system call can be used by a parent process to determine the termination of child process?","a) wait","b) exit","c) fork","d) get"," Answer: a","Explanation: wait() system call is used by the parent process to determine termination of child process. The parent process uses wait() system call and gets the exit status of the child process as well as the pid of the child process which is terminated.",""],["10. The address of the next instruction to be executed by the current process is provided by the __________","a) CPU registers","b) Program counter","c) Process stack","d) Pipe"," Answer: b","Explanation: The address of the next instruction to be executed by the current process is provided by the Program Counter. After every instruction is executed, the Program Counter is incremented by 1 i.e. address of the next instruction to be executed. CPU fetches instruction from the address denoted by Program Counter and execute it.",""],["9. What is the objective of multiprogramming?","a) Have a process running at all time","b) Have multiple programs waiting in a queue ready to run","c) To increase CPU utilization","d) None of the mentioned","Answer: c","Explanation: The objective of multiprogramming is to increase CPU utilization. Generally, a single process cannot use CPU or I/O at all time, whenever CPU or I/O is available another process can use it. Multiprogramming offers this ability to OS by keeping multiple programs in a ready queue."],["Sanfoundry Global Education & Learning Series – Operating System.","","Basics","Processes","Process Control Block","Process Scheduling Queue","Process Synchronization","Process Creation","Process Communication",""],["9. The only state transition that is initiated by the user process itself is __________","a) block","b) wakeup","c) dispatch","d) none of the mentioned","Answer: a","Explanation: The only state transition that is initiated by the user process itself is block. Whenever a user process initiates an I/O request it goes into block state unless and until the I/O request is not completed.",""],["10. In a time-sharing operating system, when the time slot given to a process is completed, the process goes from the running state to the __________","a) Blocked state","b) Ready state","c) Suspended state","d) Terminated state","Answer: b","Explanation: In a time-sharing operating system, when the time slot given to a process is completed, the process goes from the running state to the Ready State. In a time-sharing operating system unit time is defined for sharing CPU, it is called a time quantum or time slice. If a process takes less than 1 time quantum, then the process itself releases the CPU."],["9. A monitor is a module that encapsulates __________","a) shared data structures","b) procedures that operate on shared data structure","c) synchronization between concurrent procedure invocation","d) all of the mentioned"," Answer: d","Explanation: None.",""],["10. To enable a process to wait within the monitor __________","a) a condition variable must be declared as condition","b) condition variables must be used as boolean objects","c) semaphore must be used","d) all of the mentioned"," Answer: a","Explanation: None.",""]]},"coa":{"easy":[["1. The ______ format is usually used to store data.","a) BCD","b) Decimal","c) Hexadecimal","d) Octal","  Answer: a\nExplanation: The data usually used by computers have to be stored and represented in a particular format for ease of use. "],["2. The 8-bit encoding format used to store data in a computer is ______","a) ASCII","b) EBCDIC","c) ANCI","d) USCII","  Answer: b\nExplanation: The data to be stored in the computers have to be encoded in a particular way so as to provide secure processing of the data. "],["3. A source program is usually in _______","a) Assembly language","b) Machine level language","c) High-level language","d) Natural language","  Answer: c\nExplanation: The program written and before being compiled or assembled is called as a source program."],["4. Which memory device is generally made of semiconductors?","a) RAM","b) Hard-disk","c) Floppy disk","d) Cd disk","  Answer: a\nExplanation: Memory devices are usually made of semiconductors for faster manipulation of the contents."],["5. The small extremely fast, RAM’s are called as _______","a) Cache","b) Heaps","c) Accumulators","d) Stacks"," Answer: a\nExplanation: These small and fast memory devices are compared to RAM because they optimize the performance of the system and they only keep files which are required by the current process in them "],["1. The decoded instruction is stored in ______","a) IR","b) PC","c) Registers","d) MDR","  Answer: a\nExplanation: The instruction after obtained from the PC, is decoded and operands are fetched and stored in the IR. "],["2. The instruction -> Add LOCA, R0 does _______","a) Adds the value of LOCA to R0 and stores in the temp register","b) Adds the value of R0 to the address of LOCA","c) Adds the values of both LOCA and R0 and stores it in R0","d) Adds the value of LOCA with a value in accumulator and stores it in R0","  Answer: c\nExplanation: None. "],["3. Which registers can interact with the secondary storage?","a) MAR","b) PC","c) IR","d) R0","  Answer: a\nExplanation: MAR can interact with secondary storage in order to fetch data from it."],["4. During the execution of a program which gets initialized first?","a) MDR","b) IR","c) PC","d) MAR","  Answer: c\nExplanation: For the execution of a process first the instruction is placed in the PC. "],["5. Which of the register/s of the processor is/are connected to Memory Bus?","a) PC","b) MAR","c) IR","d) Both PC and MAR","  Answer: b\nExplanation: MAR is connected to the memory BUS in order to access the memory. "],["1. The main virtue for using single Bus structure is ____________","a) Fast data transfers","b) Cost effective connectivity and speed","c) Cost effective connectivity and ease of attaching peripheral devices","d) None of the mentioned","  Answer: c\nExplanation: By using a single BUS structure we can minimize the amount of hardware (wire) required and thereby reducing the cost."],["2. ______ are used to overcome the difference in data transfer speeds of various devices.","a) Speed enhancing circuitory","b) Bridge circuits","c) Multiple Buses","d) Buffer registers","  Answer: d\nExplanation: By using Buffer registers, the processor sends the data to the I/O device at the processor speed and the data gets stored in the buffer. After that the data gets sent to or from the buffer to the devices at the device speed."],["3. To extend the connectivity of the processor bus we use ________","a) PCI bus","b) SCSI bus","c) Controllers","d) Multiple bus","  Answer: a\nExplanation: PCI BUS is used to connect other peripheral devices that require a direct connection with the processor."],["4. IBM developed a bus standard for their line of computers ‘PC AT’ called _____","a) IB bus","b) M-bus","c) ISA","d) None of the mentioned","  Answer: c\nExplanation: None."],["5. The bus used to connect the monitor to the CPU is ______","a) PCI bus","b) SCSI bus","c) Memory bus","d) Rambus","  Answer: b\nExplanation: SCSI BUS is usually used to connect video devices to the processor."],["1. During the execution of the instructions, a copy of the instructions is placed in the ______","a) Register","b) RAM","c) System heap","d) Cache","  Answer: d\nExplanation: None."],["2. Two processors A and B have clock frequencies of 700 Mhz and 900 Mhz respectively. Suppose A can execute an instruction with an average of 3 steps and B can execute with an average of 5 steps. For the execution of the same instruction which processor is faster?","a) A","b) B","c) Both take the same time","d) Insufficient information","  Answer: a\nExplanation: The performance of a system can be found out using the Basic performance formula."],["3. A processor performing fetch or decoding of different instruction during the execution of another instruction is called ______","a) Super-scaling","b) Pipe-lining","c) Parallel Computation","d) None of the mentioned","  Answer: b\nExplanation: Pipe-lining is the process of improving the performance of the system by processing different instructions at the same time, with only one instruction performing one specific operation."],["4. For a given FINITE number of instructions to be executed, which architecture of the processor provides for a faster execution?","a) ISA","b) ANSA","c) Super-scalar","d) All of the mentioned","  Answer: c\nExplanation: In super-scalar architecture, the instructions are set in groups and they’re decoded and executed together reducing the amount of time required to process them."],["5. The clock rate of the processor can be improved by _________","a) Improving the IC technology of the logic circuits","b) Reducing the amount of processing done in one step","c) By using the overclocking method","d) All of the mentioned","  Answer: d\nExplanation: The clock rate(frequency of the processor) is the hardware dependent quantity it is fixed for a given processor."],["1. The instruction, Add #45,R1 does _______","a) Adds the value of 45 to the address of R1 and stores 45 in that address","b) Adds 45 to the value of R1 and stores it in R1","c) Finds the memory location 45 and adds that content to that of R1","d) None of the mentioned","  Answer: b\nExplanation: The instruction is using immediate addressing mode hence the value is stored in the location 45 is added. "],["2. In the case of, Zero-address instruction method the operands are stored in _____","a) Registers","b) Accumulators","c) Push down stack","d) Cache","  Answer: c\nExplanation: In this case, the operands are implicitly loaded onto the ALU. "],["3. Add #45, when this instruction is executed the following happen/s _______","a) The processor raises an error and requests for one more operand","b) The value stored in memory location 45 is retrieved and one more operand is requested","c) The value 45 gets added to the value on the stack and is pushed onto the stack","d) None of the mentioned","  Answer: b\nExplanation: None.  "],["","  Answer: a\nExplanation: In this addressing mode, the value of the register serves as another memory location and hence we use pointers to get the data.  "],["4. The addressing mode which makes use of in-direction pointers is ______","a) Indirect addressing mode","b) Index addressing mode","c) Relative addressing mode","d) Offset addressing mode","  Answer: d\nExplanation: This instruction is in Base with offset addressing mode.    "]],"medium":[["6. The ALU makes use of _______ to store the intermediate results.","a) Accumulators","b) Registers","c) Heap","d) Stack","  Answer: a\nExplanation: The ALU is the computational center of the CPU. It performs all mathematical and logical operations. In order to perform better, it uses some internal memory spaces to store immediate results."],["7. The control unit controls other units by generating ___________","a) Control signals","b) Timing signals","c) Transfer signals","d) Command Signals","  Answer: b\nExplanation: This unit is used to control and coordinate between the various parts and components of the CPU.\n"],["8. ______ are numbers and encoded characters, generally used as operands.","a) Input","b) Data","c) Information","d) Stored Values","  Answer: b\nExplanation: None. "],["6. ISP stands for _________","a) Instruction Set Processor","b) Information Standard Processing","c) Interchange Standard Protocol","d) Interrupt Service Procedure","  Answer: a\nExplanation: None. "],["7. The internal components of the processor are connected by _______","a) Processor intra-connectivity circuitry","b) Processor bus","c) Memory bus","d) Rambus","  Answer: b\nExplanation: The processor BUS is used to connect the various parts in order to provide a direct connection to the CPU.  "],["8. ______ is used to choose between incrementing the PC or performing ALU operations.","a) Conditional codes","b) Multiplexer","c) Control unit","d) None of the mentioned","  Answer: b\nExplanation: The multiplexer circuit is used to choose between the two as it can give different results based on the input. "],["6. ANSI stands for __________","a) American National Standards Institute","b) American National Standard Interface","c) American Network Standard Interfacing","d) American Network Security Interrupt","  Answer: a\nExplanation: None."],["7. _____ register Connected to the Processor bus is a single-way transfer capable.","a) PC","b) IR","c) Temp","d) Z","  Answer: d\nExplanation: The Z register is a special register which can interact with the processor BUS only."],["8. In multiple Bus organisation, the registers are collectively placed and referred as ______","a) Set registers","b) Register file","c) Register Block","d) Map registers","  Answer: b\nExplanation: None."],["6. An optimizing Compiler does _________","a) Better compilation of the given piece of code","b) Takes advantage of the type of processor and reduces its process time","c) Does better memory management","d) None of the mentioned","  Answer: b\nExplanation: An optimizing compiler is a compiler designed for the specific purpose of increasing the operation speed of the processor by reducing the time taken to compile the program instructions."],["7. The ultimate goal of a compiler is to ________","a) Reduce the clock cycles for a programming task","b) Reduce the size of the object code","c) Be versatile","d) Be able to detect even the smallest of errors","  Answer: a\nExplanation: None."],["8. SPEC stands for _______","a) Standard Performance Evaluation Code","b) System Processing Enhancing Code","c) System Performance Evaluation Corporation","d) Standard Processing Enhancement Corporation","  Answer: c\nExplanation: SPEC is a corporation that started to standardize the evaluation method of a system’s performance."],["5. In the following indexed addressing mode instruction, MOV 5(R1), LOC the effective address is ______","a) EA = 5+R1","b) EA = R1","c) EA = [R1]","d) EA = 5+[R1]","  Answer: b\nExplanation: In this, the contents of the PC are directly incremented. "],["6. The addressing mode/s, which uses the PC instead of a general purpose register is ______","a) Indexed with offset","b) Relative","c) Direct","d) Both Indexed with offset and direct","  Answer: d\nExplanation: In the case of, auto increment the increment is done afterward and in auto decrement the decrement is done first.  "],["7. When we use auto increment or auto decrements, which of the following is/are true?","1) In both, the address is used to retrieve the operand and then the address gets altered","2) In auto increment, the operand is retrieved first and then the address altered","3) Both of them can be used on general purpose registers as well as memory locations","a) 1, 2, 3","  Answer: a\nExplanation: None. "]],"hard":[["9. The Input devices can send information to the processor.","a) When the SIN status flag is set","b) When the data arrives regardless of the SIN flag","c) Neither of the cases","d) Either of the cases","  Answer: a","Explanation: The input devices use buffers to store the data received and when the buffer has some data it sends it to the processor. "],["10. ______ bus structure is usually used to connect I/O devices.","a) Single bus","b) Multiple bus","c) Star bus","d) Rambus","  Answer: a","Explanation: BUS is a bunch of wires which carry address, control signals and data. It is used to connect various components of the computer."],["9. The registers, ALU and the interconnection between them are collectively called as _____","a) process route","b) information trail","c) information path","d) data path","  Answer: d","Explanation: The Operational and processing part of the CPU are collectively called as a data path. "],["10. _______ is used to store data in registers.","a) D flip flop","b) JK flip flop","c) RS flip flop","d) None of the mentioned","  Answer: a","Explanation: None. "],["9. The main advantage of multiple bus organisation over a single bus is _____","a) Reduction in the number of cycles for execution","b) Increase in size of the registers","c) Better Connectivity","d) None of the mentioned","  Answer: a","Explanation: None. "],["10. The ISA standard Buses are used to connect ___________","a) RAM and processor","b) GPU and processor","c) Harddisk and Processor","d) CD/DVD drives and Processor","  Answer: c","Explanation: None."],["9. As of 2000, the reference system to find the performance of a system is _____","a) Ultra SPARC 10","b) SUN SPARC","c) SUN II","d) None of the mentioned","  Answer: a","Explanation: In SPEC system of measuring a system’s performance, a system is used as a reference against which other systems are compared and performance is determined."],["10. When Performing a looping operation, the instruction gets stored in the ______","a) Registers","b) Cache","c) System Heap","d) System stack","  Answer: b","Explanation: When a looping or branching operation is carried out the offset value is stored in the cache along with the data. "],["","  Answer: c","Explanation: The addressing mode used is base with offset and index. "],["8. The addressing mode, where you directly specify the operand value is _______","a) Immediate","b) Direct","c) Definite","d) Relative","  Answer: a","Explanation: The relative addressing mode is used for this since it directly updates the PC."]]}}